import numpy as np

# 设置参数(主要)
# 種群數量
pop = 30
# 維度
dim = 3 # 维度
# 最大迭代次數
MaxIter = 100  
# 下邊界
lb = [0.05,0.25,2]
# 上邊界
ub = [2,1.3,15]

# 拉壓彈簧問題
def fun(X):
    # 變數
    x1 = X[0]
    x2 = X[1]
    x3 = X[2]
    #约束条件判断
    g1 = 1-(x2**3*x3)/(71785*x1**4)
    g2 = (4*x2**2-x1*x2)/(12566*(x2*x1**3-x1**4))+1/(5108*x1**2)-1
    g3 = 1-(140.45*x1)/(x2**2*x3)
    g4 = (x1+x2)/1.5-1
    if g1<=0 and g2<=0 and g3<=0 and g4<=0:
        #如果满足约束条件则计算适应度值
        fitness = (x3+2)*x2*x1**2
    else:
        #如果不满足约束条件，则设置适应度值为很大的一个惩罚数
        fitness = 10E32
    
    return fitness
